# PYTHON â€“ WORKSHEET 9 (PANDAS) (Solutions)

**ANS 1)** D) All of the above           
**ANS 2)** A) True       
**ANS 3)** D) All of the above  
**ANS 4)** D) Error    
**ANS 5)** B) 2 dimensional    
**ANS 6)** D) 1   
**ANS 7)** C) ix    
**ANS 8)** B) value, size   
**ANS 9)** B) Series can be passed into most NumPy methods expecting an ndarray.   
C) A key difference between Series and ndarray is that operations between Series automatically align the data based on label.              
D) In pandas, Index values must be unique                
**ANS 10)** A) JSON, B) HTML, C) CSV, D) TXT

**ANS 11)**

In [1]:
# Importing libraries...
import pandas as pd
import numpy as np

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin',
'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['I', 'II', 'III', 'IV', 'V', 'VI', 'VII', 'VIII', 'IX', 'X']

# Making a Dataframe..
df=pd.DataFrame(exam_data,labels)

In [2]:
# Displaying dataframe..
df

           name  score  attempts qualify
I     Anastasia   12.5         1     yes
II         Dima    9.0         3      no
III   Katherine   16.5         2     yes
IV        James    NaN         3      no
V         Emily    9.0         2      no
VI      Michael   20.0         3     yes
VII     Matthew   14.5         1     yes
VIII      Laura    NaN         1      no
IX        Kevin    8.0         2      no
X         Jonas   19.0         1     yes

**ANS 12)**

In [3]:
# Displaying the first five rows..
df.head()

          name  score  attempts qualify
I    Anastasia   12.5         1     yes
II        Dima    9.0         3      no
III  Katherine   16.5         2     yes
IV       James    NaN         3      no
V        Emily    9.0         2      no

**ANS 13)**

In [4]:
# Displaying Features 'name' and 'score'
df1=df[['name','score']]
df1

           name  score
I     Anastasia   12.5
II         Dima    9.0
III   Katherine   16.5
IV        James    NaN
V         Emily    9.0
VI      Michael   20.0
VII     Matthew   14.5
VIII      Laura    NaN
IX        Kevin    8.0
X         Jonas   19.0

**ANS 14)**

In [5]:
# Displaying given rows
print(df1[['name', 'score']].iloc[[3, 5, 6,8]])

        name  score
IV     James    NaN
VI   Michael   20.0
VII  Matthew   14.5
IX     Kevin    8.0

**ANS 15)**

In [6]:
# displaying rows having score between 15 and 20.
print(df1[df1['score'].between(15, 20)])

          name  score
III  Katherine   16.5
VI     Michael   20.0
X        Jonas   19.0

**End of the document**